#if (GAME == 5)
#define RANK_DESC \
	"非常簡単的難度　     （面向初学者）　 ", \
	"標準難度　　　    （面向大衆）　　", \
	"高難度　　　（面向街機玩家）", \
	"非常高難度　（面向ＳＴＧ專家）",
#else
#define RANK_DESC \
	"非常簡単的難度　（初学者向け、共５面）", \
	"標準難度　　　（面向大衆、共６面）　　", \
	"高難度　　　（面向街機玩家）　　", \
	"非常高難度　（面向ＳＴＧ專家）　　",
#endif

#define MENU_DESCRIPTIONS { \
	/*  0 */ "開始遊戲", \
	/*  1 */ "開始遊玩Ｅｘｔｒａ關", \
	/*  2 */ "最高得分", \
	/*  3 */ "進入音楽室", \
	/*  4 */ "調整設置", \
	/*  5 */ "回到ＤＯＳ", \
	/*  6 */ RANK_DESC \
	/* 10 */ "調整遊戲初始殘機（不適用於Ｅｘｔｒａ模式）", \
	/* 11 */ "調整遊戲初始Ｂｏｏｍ（不適用於Ｅｘｔｒａ模式）", \
	/* 12 */ "不播放ＢＧＭ", \
	/* 13 */ "ＢＧＭ使用２６Ｋ音源兼容模式播放", \
	/* 14 */ "ＢＧＭ使用８６音源兼容模式播放", \
	/* 15 */ "不播放音効", \
	/* 16 */ "使用ＦＭ音源音効", \
	/* 17 */ "使用蜂鳴器音効", \
	/* 18 */ "敵弾多的地方、降低遊戲幀率（変慢）（初学者用）", \
	/* 19 */ "照常処理幀率（標準）", \
	/* 20 */ "恢復默認選項", \
	/* 21 */ "返回標題界面", \
	/* 22 */ "開始遊戲（簡単模式）", \
	/* 23 */ "開始遊戲（一般模式）", \
	/* 24 */ "開始遊戲（困難模式）", \
	/* 25 */ "開始遊戲（Ｌｕｎａｔｉｃ模式）", \
}

// Not an error, the game still starts despite this message.
#define MEMORY_INSUFFICIENT \
	"\n" \
	"内存不足。請先增加可用内存再繼續執行\n"
